#+TITLE: Plan for Vlabs Landing Pages
#+AUTHOR: VLEAD
#+DATE: [2017-09-11 Mon]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  - This document contains the realization plan for
    implementing the VLABS portal driven by data.

* Milestones Snapshot

  |---+----+----+-----+------------------------------------------------+------+--------+-------+-------+--------|
  |   | S. | Mi | Req | Milestone                                      | Plan | Status |   Est |   Act | Issues |
  |   | no | no | Map |                                                |      |        |   hrs |   hrs |        |
  |---+----+----+-----+------------------------------------------------+------+--------+-------+-------+--------|
  |   | 1. | [[https://github.com/vlead/vlabs-landing-pages/milestone/9][9]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/9][upgrade openedx version from dogwood to ginkgo]] | [[Fix back button functionality][ref]]  | Open   |    18 |     0 | [[https://github.com/vlead/vlabs-landing-pages/milestone/9][ref]]    |
  |---+----+----+-----+------------------------------------------------+------+--------+-------+-------+--------|
  |   | 2. | [[https://github.com/vlead/vlabs-landing-pages/milestone/8][8]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/8][Fix back button functionality]]                  | [[Fix back button functionality][ref]]  | Open   |   160 |     0 | [[https://github.com/vlead/vlabs-landing-pages/milestone/8][ref]]    |
  |---+----+----+-----+------------------------------------------------+------+--------+-------+-------+--------|
  |   | 3. | [[https://github.com/vlead/vlabs-landing-pages/milestone/7][7]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/7][Deployment of 'vlabs landing pages' v1.2.0]]     | [[Deployment of Vlabs landing pages][ref]]  | Closed |   472 |     6 | [[https://github.com/vlead/vlabs-landing-pages/milestone/7?closed=1][ref]]    |
  |---+----+----+-----+------------------------------------------------+------+--------+-------+-------+--------|
  |   | 4. | [[https://github.com/vlead/vlabs-landing-pages/milestone/6][6]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/6][Signup and Login functionality]]                 | [[Login and Register functionality][ref]]  | Open   |   266 | 178.5 | [[https://github.com/vlead/vlabs-landing-pages/milestone/6][ref]]    |
  |---+----+----+-----+------------------------------------------------+------+--------+-------+-------+--------|
  |   | 5. | [[https://github.com/vlead/vlabs-landing-pages/milestone/5][5]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/5][Search functionality]]                           | [[Search Functionality][ref]]  | Closed |   472 | 217.5 | [[https://github.com/vlead/vlabs-landing-pages/milestone/5?closed=1][ref]]    |
  |---+----+----+-----+------------------------------------------------+------+--------+-------+-------+--------|
  |   | 6. | [[https://github.com/vlead/vlabs-landing-pages/milestone/4][4]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/4][Populate data using lds]]                        | [[Loading data dynamically from LDS][ref]]  | Closed | 357.5 | 303.5 | [[https://github.com/vlead/vlabs-landing-pages/milestone/4?closed=1][ref]]    |
  |---+----+----+-----+------------------------------------------------+------+--------+-------+-------+--------|
  |   | 7. | [[https://github.com/vlead/vlabs-landing-pages/milestone/1][1]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/1][Building landing pages using LDS]]               |      | Closed |       |       | [[https://github.com/vlead/vlabs-landing-pages/milestone/1?closed=1][ref]]    |
  |---+----+----+-----+------------------------------------------------+------+--------+-------+-------+--------|
  |   |    |    |     | Total                                          |      |        | 951.5 |  521. |        |
  | ^ |    |    |     |                                                |      |        |   est |   act |        |
  |---+----+----+-----+------------------------------------------------+------+--------+-------+-------+--------|
  #+TBLFM: @3$8=remote(tbl-rlz-pln-ml-9, $est)
  #+TBLFM: @3$9=remote(tbl-rlz-pln-ml-9, $act)
  #+TBLFM: @4$8=remote(tbl-rlz-pln-ml-8, $est)
  #+TBLFM: @4$9=remote(tbl-rlz-pln-ml-8, $act)
  #+TBLFM: @5$9=remote(tbl-rlz-pln-ml-7, $est)
  #+TBLFM: @5$9=remote(tbl-rlz-pln-ml-7, $act)
  #+TBLFM: @6$8=remote(tbl-rlz-pln-ml-6, $est)
  #+TBLFM: @6$9=remote(tbl-rlz-pln-ml-6, $act)
  #+TBLFM: @7$8=remote(tbl-rlz-pln-ml-5, $est)
  #+TBLFM: @7$9=remote(tbl-rlz-pln-ml-5, $act)
  #+TBLFM: @8$8=remote(tbl-rlz-pln-ml-4, $est)
  #+TBLFM: @8$9=remote(tbl-rlz-pln-ml-4, $act)

  #+TBLFM: $est=vsum(@II+1..@-1)
  #+TBLFM: $act=vsum(@II+1..@-1)

* Detailed Plan 
** Fix back button functionality
#+caption:  realization-plan-milestone-8
#+name: tbl-rlz-pln-ml-8

|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
|   |    S. | Tasks                 | Github | Expected | Actual |  Estimated |     Actual | Status | Assignee |
|   |    NO |                       | Issues |   Effort | Effort |     Start, |     Start/ |        |          |
|   |       |                       |        |      (in |    (in |        End |        End |        |          |
|   |       |                       |        |   person | person |      Dates |      Dates |        |          |
|   |       |                       |        |   hours) | hours) |            |            |        |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
|   |    1. | Styles are breaking,  | [[https://github.com/vlead/vlabs-landing-pages/issues/118][#118]]   |       32 |     12 | 12-12-2017 | 12-12-2017 | Done   | Madhavi  |
|   |       | while traveling       |        |          |        | 15-12-2017 | 12-12-2017 |        | Sripathi |
|   |       | through browser back  |        |          |        |            |            |        |          |
|   |       | button from the       |        |          |        |            |            |        |          |
|   |       | experiment page to    |        |          |        |            |            |        |          |
|   |       | institutes page       |        |          |        |            |            |        |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
|   |    2. | Styles are breaking,  | [[https://github.com/vlead/vlabs-landing-pages/issues/119][#119]]   |       32 |     12 | 01-11-2017 | 06-12-2017 | Done   | Madhavi  |
|   |       | while traveling       |        |          |        | 06-10-2017 | 06-12-2017 |        | Sripathi |
|   |       | through browser back  |        |          |        |            |            |        |          |
|   |       | button from the       |        |          |        |            |            |        |          |
|   |       | experiment page to    |        |          |        |            |            |        |          |
|   |       | disciplines page      |        |          |        |            |            |        |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
|   |    3. | Bug:Loading labs and  | [[https://github.com/vlead/vlabs-landing-pages/issues/116][#116]]   |       48 |     12 | 12-12-2017 | 12-12-2017 | Done   | Madhavi  |
|   |       | institutes in a same  |        |          |        | 15-12-2017 | 12-12-2017 |        | Sripathi |
|   |       | page, while traveling |        |          |        |            |            |        |          |
|   |       | through browser back  |        |          |        |            |            |        |          |
|   |       | button from the       |        |          |        |            |            |        |          |
|   |       | experiment page       |        |          |        |            |            |        |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
|   |    4. | Bug: Loading labs and | [[https://github.com/vlead/vlabs-landing-pages/issues/117][#117]]   |       48 |     12 | 01-11-2017 | 07-12-2017 | Done   | Madhavi  |
|   |       | disciplines in a same |        |          |        | 07-11-2017 | 07-12-2017 |        | Sripathi |
|   |       | page, while traveling |        |          |        |            |            |        |          |
|   |       | through browser back  |        |          |        |            |            |        |          |
|   |       | button from the       |        |          |        |            |            |        |          |
|   |       | experiment page       |        |          |        |            |            |        |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
|   |    5. | Sort the Lab names    | [[https://github.com/vlead/vlabs-landing-pages/issues/155][#115]]   |       24 |      3 | 14-11-2017 | 14-11-2017 | Done   | Madhavi  |
|   |       | in all functions      |        |          |        | 14-11-2017 | 14-11-2017 |        |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
|   |    6. | Sort the names of     | [[https://github.com/vlead/vlabs-landing-pages/issues/154][#154]]   |       24 |      6 | 13-11-2017 | 13-11-2017 | Done   | Madhavi  |
|   |       | Institutes and        |        |          |        | 13-11-2017 | 13-11-2017 |        |          |
|   |       | Disciplines in Drop   |        |          |        |            |            |        |          |
|   |       | down menu             |        |          |        |            |            |        |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
|   | Total |                       |        |      208 |     57 |            |            |        |          |
| ^ |       |                       |        |      est |    act |            |            |        |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)

** Deployment of Vlabs landing pages
#+caption:  realization-plan-milestone-7
#+name: tbl-rlz-pln-ml-7

|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
|   | S.    | Tasks                 | Github | Expected | Actual | Estimated  | Actual     | Status | Assignee |
|   | NO    |                       | Issues | Effort   | Effort | Start,     | Start/     |        |          |
|   |       |                       |        | (in      | (in    | End        | End        |        |          |
|   |       |                       |        | person   | person | Dates      | Dates      |        |          |
|   |       |                       |        | hours)   | hours) |            |            |        |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
|   | 1.    | Deployment of         | [[https://github.com/vlead/vlabs-landing-pages/issues/126][#126]]   | 6        | 4      | 01-11-2017 | 01-11-2017 | Done   | Madhavi  |
|   |       | 'vlabs landing pages' |        |          |        |            |            |        |          |
|   |       | on Testing and        |        |          |        |            |            |        |          |
|   |       | Stagging              |        |          |        |            |            |        |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
|   | Total |                       |        | 6        | 4      |            |            |        |          |
| ^ |       |                       |        | est      | act    |            |            |        |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+----------|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)
** Login and Register functionality
     Once this [[https://github.com/vlead/vlabs-landing-pages/milestone/6][milestone]] is realized, the following are
  completed in the VLABS portal:
  1. Sign In functionality 
  2. Register functionality
#+caption:  realization-plan-milestone-6
#+name: tbl-rlz-pln-ml-6
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    S. | Tasks                 | Github | Expected | Actual |  Estimated |     Actual | Status | Assignee  |
|   |    NO |                       | Issues |   Effort | Effort |     Start, |     Start/ |        |           |
|   |       |                       |        |      (in |    (in |        End |        End |        |           |
|   |       |                       |        |   person | person |      Dates |      Dates |        |           |
|   |       |                       |        |   hours) | hours) |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    1. | Adding login          | [[https://github.com/vlead/vlabs-landing-pages/issues/89][#89]]    |       20 |     12 | 09-10-2017 | 09-10-2017 | Done   | Sripathi  |
|   |       | functionality for     |        |          |        | 12-10-2017 | 11-10-2017 |        |           |
|   |       | vlabs landing page    |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    2. | Adding signup         | [[https://github.com/vlead/vlabs-landing-pages/issues/88][#88]]    |       30 |     12 | 17-10-2017 | 17-10-2017 | Done   | Sripathi  |
|   |       | functionality for     |        |          |        | 23-10-2017 | 19-10-2017 |        |           |
|   |       | vlabs landing page    |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    3. | Enable Sign up        | [[https://github.com/vlead/vlabs-landing-pages/issues/87][#87]]    |        2 |      1 | 24-10-2017 | 24-10-2017 | Done   | Madhavi   |
|   |       | and Login buttons     |        |          |        | 24-10-2017 | 24-10-2017 |        |           |
|   |       | (includes             |        |          |        |            |            |        |           |
|   |       | functionality)        |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    4. | Interaction between   | [[https://github.com/vlead/vlabs-landing-pages/issues/97][#97]]    |       24 |     18 | 13-10-2017 | 13-10-2017 | Done   | Sripathi  |
|   |       | iframes using         |        |          |        | 16-10-2017 | 16-10-2017 |        |           |
|   |       | post message          |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    5. | setup machine to      | [[https://github.com/vlead/vlabs-landing-pages/issues/102][#102]]   |       16 |     20 | 13-10-2017 | 13-10-2017 | Done   | Sripathi  |
|   |       | run openedx vagrant   |        |          |        | 16-10-2017 | 16-10-2017 |        |           |
|   |       | box for development   |        |          |        |            |            |        |           |
|   |       | environment           |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    6. | configure post        | [[https://github.com/vlead/vlabs-landing-pages/issues/121][#121]]   |       18 |     12 | 26-10-2017 | 26-10-2017 | Done   | Sripathi  |
|   |       | message Javascript    |        |          |        | 30-10-2017 | 27-11-2017 |        |           |
|   |       | snippet on            |        |          |        |            |            |        |           |
|   |       | themeless.vlabs.ac.in |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    7. | Integration of        | [[https://github.com/vlead/vlabs-landing-pages/issues/128][#128]]   |       18 |     12 | 01-11-2017 | 01-11-2017 |        |           |
|   |       | Openedx urls to       |        |          |        | 03-11-2017 | 27-11-2017 | Done   | Sripathi  |
|   |       | registration, sign    |        |          |        |            |            |        |           |
|   |       | in and sign out       |        |          |        |            |            |        |           |
|   |       | buttons               |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    8. | provision container   | [[https://github.com/vlead/vlabs-landing-pages/issues/129][#129]]   |       12 |      6 | 02-11-2017 | 02-11-2017 | Done   |           |
|   |       | on stagging server    |        |          |        | 03-11-2017 | 27-11-2017 |        | Sripathi  |
|   |       | to host the           |        |          |        |            |            |        |           |
|   |       | vlabs-landing pages   |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |    9. | Add pointers(Hand     | [[https://github.com/vlead/vlabs-landing-pages/issues/130][#130]]   |        4 |      2 | 07-11-2017 | 07-11-2017 | Done   | Mrudhvika |
|   |       | symbol) to register   |        |          |        | 13-10-2017 | 13-10-2017 |        |           |
|   |       | and login buttons     |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   10. | Click here for        | [[https://github.com/vlead/vlabs-landing-pages/issues/131][#131]]   |        0 |      0 | 20-11-2017 | 20-11-2017 |        | Mrudhvika |
|   |       | feedback link is not  |        |          |        | 20-11-2017 | 20-11-2017 | Done   |           |
|   |       | redirecting to        |        |          |        |            |            |        |           |
|   |       | feedback page         |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   11. | Add urls to about     | [[https://github.com/vlead/vlabs-landing-pages/issues/132][#132]]   |        6 |      2 | 22-11-2017 | 22-11-2017 | Done   | Balamma   |
|   |       | in the header         |        |          |        | 22-11-2017 | 22-11-2017 |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   12. | remove header and     | [[https://github.com/vlead/vlabs-landing-pages/issues/133][#133]]   |       24 |     12 | 22-11-2017 | 22-11-2017 | Done   |           |
|   |       | footer sections in    |        |          |        | 23-10-2017 | 23-10-2017 |        | Balamma   |
|   |       | themeless.vlabs.ac.in |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   13. | Searching of labs     | [[https://github.com/vlead/vlabs-landing-pages/issues/134][#134]]   |        6 |      4 | 23-11-2017 | 23-11-2017 | Done   | Madhavi   |
|   |       | on enter button       |        |          |        | 23-11-2017 | 23-11-2017 |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   14. | Script for            | [[https://github.com/vlead/vlabs-landing-pages/issues/136][#136]]   |       12 |     10 | 23-11-2017 | 23-11-2017 | Done   | Sripathi  |
|   |       | demonstration of      |        |          |        | 24-11-2017 | 28-11-2017 |        | Thirumal  |
|   |       | vlabs landing pages   |        |          |        |            |            |        | Mrudhvika |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   15. | Testing of            | [[https://github.com/vlead/vlabs-landing-pages/issues/137][#137]]   |       30 |     25 | 23-11-2017 | 23-11-2017 | Done   | Sripathi  |
|   |       | vlabs landing pages   |        |          |        | 28-11-2017 | 28-11-2017 |        | Mrudhvika |
|   |       |                       |        |          |        |            |            |        | Madhavi   |
|   |       |                       |        |          |        |            |            |        | Balamma   |
|   |       |                       |        |          |        |            |            |        | Thirumal  |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   16. | Deployment of         | [[https://github.com/vlead/vlabs-landing-pages/issues/138][#138]]   |        6 |      4 | 13-10-2017 | 13-10-2017 |        | Madhavi   |
|   |       | vlabs landing pages   |        |          |        | 13-10-2017 | 13-10-2017 | Done   | Sripathi  |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   17. | Release the beta      | [[https://github.com/vlead/vlabs-landing-pages/issues/139][#139]]   |        6 |      4 | 28-11-2017 | 28-10-2017 |        | Madhavi   |
|   |       | version of            |        |          |        | 28-11-2017 | 28-10-2017 |        | Sripathi  |
|   |       | vlabs landing pages   |        |          |        |            |            | Done   | Mrudhvika |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   18. | Searching of labs     | [[https://github.com/vlead/vlabs-landing-pages/issues/140][#140]]   |        6 |      4 | 27-10-2017 | 27-10-2017 | Done   | Madhavi   |
|   |       | by entering lab       |        |          |        | 27-10-2017 | 27-10-2017 |        |           |
|   |       | name as keyword Done  |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   19. | Loading dynamic       | [[https://github.com/vlead/vlabs-landing-pages/issues/141][#141]]   |        6 |      4 | 23-10-2017 | 23-10-2017 | Done   | Madhavi   |
|   |       | usage data on         |        |          |        | 23-10-2017 | 23-10-2017 |        |           |
|   |       | vlabs landing pages   |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   20. | Mobile responsive     | [[https://github.com/vlead/vlabs-landing-pages/issues/143][#143]]   |        6 |      2 | 24-11-2017 | 24-10-2017 | Done   | Balamma   |
|   |       | header                |        |          |        | 24-11-2017 | 24-10-2017 |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   21. | Mobile responsive     | [[https://github.com/vlead/vlabs-landing-pages/issues/144][#144]]   |        6 |      2 | 24-10-2017 | 24-10-2017 |        |           |
|   |       | banner                |        |          |        | 24-10-2017 | 24-10-2017 | Done   | Balamma   |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   22. | Update logo url       | [[https://github.com/vlead/vlabs-landing-pages/issues/145][#145]]   |        1 |    0.5 | 24-11-2017 | 24-11-2017 | Done   | Balamma   |
|   |       |                       |        |          |        | 24-11-2017 | 24-11-2017 |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   23. | load search results   | [[https://github.com/vlead/vlabs-landing-pages/issues/146][#146]]   |        6 |      4 | 27-10-2017 | 27-10-2017 | Done   |           |
|   |       | and all labs list in  |        |          |        | 27-10-2017 | 27-10-2017 |        | Madhavi   |
|   |       | place of openedx sign |        |          |        |            |            |        |           |
|   |       | in/sign out pages     |        |          |        |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   |   24. | Review of             | [[https://github.com/vlead/vlabs-landing-pages/issues/147][#147]]   |        1 |      6 | 28-10-2017 | 28-10-2017 |        | Sripathi  |
|   |       | vlabs landing pages   |        |          |        | 28-10-2017 | 28-10-2017 | Done   | Priya     |
|   |       | demonstration script  |        |          |        |            |            |        | Thirumal  |
|   |       |                       |        |          |        |            |            |        | Balamma   |
|   |       |                       |        |          |        |            |            |        | Mrudhvika |
|   |       |                       |        |          |        |            |            |        | Madhavi   |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
|   | Total |                       |        |      266 |  178.5 |            |            |        |           |
| ^ |       |                       |        |      est |    act |            |            |        |           |
|---+-------+-----------------------+--------+----------+--------+------------+------------+--------+-----------|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)

** Search Functionality
  Once this [[https://github.com/vlead/vlabs-landing-pages/milestone/5][milestone]] is realized, Search functionality is
  available in the VLABS portal:

#+caption:  realization-plan-milestone-5
#+name: tbl-rlz-pln-ml-5

|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |    S. | Tasks                | Github     | Expected | Actual |  Estimated |     Actual | Status      | Assignee  |
|   |    NO |                      | Issues     |   Effort | Effort |     Start, |     Start/ |             |           |
|   |       |                      |            |      (in |    (in |        End |        End |             |           |
|   |       |                      |            |   person | person |      Dates |      Dates |             |           |
|   |       |                      |            |   hours) | hours) |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |    1. | Adding key word      | [[https://github.com/vlead/vlabs-landing-pages/issues/86][#86]]        |       48 |        | 27-10-2017 |            | backlog     | Madhavi   |
|   |       | based search         |            |          |        | 29-10-2017 |            |             |           |
|   |       | feature              |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |    2. | Unable to navigate   | [[https://github.com/vlead/vlabs-landing-pages/issues/85][#85]]        |          |        | 29-10-2017 |            | bug         | Madhavi   |
|   |       | institute wise       |            |       32 |        | 30-10-2017 |            |             |           |
|   |       | labs from            |            |          |        |            |            |             |           |
|   |       | experiment page      |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |    3. | Header and footer    | [[https://github.com/vlead/vlabs-landing-pages/issues/84][#84]]        |       16 |     16 | 16-10-2017 | 16-10-2017 | bug         | Balamma   |
|   |       | not visible in       |            |          |        | 18-10-2017 | 18-10-2017 | Done        | Mrudhvika |
|   |       | open-edx labs        |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |    4. | Add a Favicon to     | [[https://github.com/vlead/vlabs-landing-pages/issues/83][#83]]        |       03 |     01 | 19-10-2017 | 19-10-2017 | Done        | Balamma   |
|   |       | vlabs landing page   |            |          |        | 19-10-2017 | 19-10-2017 |             | Mrudhvika |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |    5. | Setting of search    | [[https://github.com/vlead/vlabs-landing-pages/issues/82][#82]]        |       06 |     06 | 09-10-2017 | 10-10-2017 | Done        | Balamma   |
|   |       | icon width and       |            |          |        | 09-10-2017 | 10-10-2017 |             |           |
|   |       | height               |            |          |        |            |            |             | Mrudhvika |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |    6. | Fix Grid layout      | [[https://github.com/vlead/vlabs-landing-pages/issues/81][#81]]        |       16 |     12 | 12-10-2017 | 13-10-2017 | bug         | Balamma   |
|   |       | styles               |            |          |        | 14-10-2017 | 14-10-2017 | Done        | Mrudhvika |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |    7. | Header is repeating  | [[https://github.com/vlead/vlabs-landing-pages/issues/80][#80]]        |       32 |     14 | 13-10-2017 | 24-10-2017 | Done        | Mrudhvika |
|   |       | twice when broswer   |            |          |        | 14-10-2017 | 24-10-2017 |             | Balamma   |
|   |       | 'back' button was    |            |          |        |            |            |             |           |
|   |       | clicked              |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |    8. | Micro biology I      | [[https://github.com/vlead/vlabs-landing-pages/issues/90][#90]]        |       03 |     03 | 10-10-2017 | 10-10-2017 | Done        | Mrudhvika |
|   |       | and Molecular        |            |          |        | 10-10-2017 | 10-10-2017 |             |           |
|   |       | fluorescence         |            |          |        |            |            |             |           |
|   |       | spectroscopy         |            |          |        |            |            |             |           |
|   |       | have same images     |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |    9. | Verifying the list   | [[https://github.com/vlead/vlabs-landing-pages/issues/91][#91]]        |       03 |     04 | 10-10-2017 | 10-10-2017 | Done        | Mrudhvika |
|   |       | of captured labs.    |            |          |        | 10-10-2017 | 10-10-2017 |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   10. | Remove hyperlink of  | [[https://github.com/vlead/vlabs-landing-pages/issues/92][#92]]        |       04 |     04 | 10-10-2017 | 10-10-2017 | Done        | Mrudhvika |
|   |       | disciplines titles   |            |          |        | 10-10-2017 | 10-10-2017 |             | Balamma   |
|   |       | on all disciplines   |            |          |        |            |            |             |           |
|   |       | page.                |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   11. | Remove hyperlink of  | [[https://github.com/vlead/vlabs-landing-pages/issues/93][#93]]        |       04 |     04 | 11-10-2017 | 11-10-2017 | Done        | Mrudhvika |
|   |       | institutes titles    |            |          |        | 11-10-2017 | 11-10-2017 |             | Balamma   |
|   |       | on all institutes    |            |          |        |            |            |             |           |
|   |       | page.                |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   12. | Align institutes     | [[https://github.com/vlead/vlabs-landing-pages/issues/94][#94]]        |       06 |     04 | 11-10-2017 | 11-10-2017 | Done        | Balamma   |
|   |       | titles along with    |            |          |        | 11-10-2017 | 11-10-2017 |             | Mrudhvika |
|   |       | institute logos      |            |          |        |            |            |             |           |
|   |       | on all institutes.   |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   13. | Align disciplines    | [[https://github.com/vlead/vlabs-landing-pages/issues/95][#95]]        |       06 |     06 | 11-10-2017 | 11-10-2017 | Done        | Balamma   |
|   |       | titles along with    |            |          |        | 11-10-2017 | 11-10-2017 |             | Mrudhvika |
|   |       | disciplines logos    |            |          |        |            |            |             |           |
|   |       | on all disciplines   |            |          |        |            |            |             |           |
|   |       | page.                |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   14. | Align lab titles     | [[https://github.com/vlead/vlabs-landing-pages/issues/96][#96]]        |       08 |     08 | 12-10-2017 | 12-10-2017 | Done        | Balamma   |
|   |       | along with labs      |            |          |        | 12-10-2017 | 12-10-2017 |             | Mrudhvika |
|   |       | images on all labs   |            |          |        |            |            |             |           |
|   |       | page                 |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   15. | Changing the lab     | [[https://github.com/vlead/vlabs-landing-pages/issues/98][#98]]        |       04 |     04 | 14-10-2017 | 14-10-2017 | Done        | Mrudhvika |
|   |       | names in Title       |            |          |        | 14-10-2017 | 14-10-2017 |             | Sanchita  |
|   |       | case from lower      |            |          |        |            |            |             |           |
|   |       | case type            |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   16. | Change lab names     | [[https://github.com/vlead/vlabs-landing-pages/issues/99][#99]]        |       08 |     08 | 21-10-2017 | 21-10-2017 | Done        | Balamma   |
|   |       | styles and images    |            |          |        | 21-10-2017 | 21-10-2017 |             | Mrudhvika |
|   |       | properties as per    |            |          |        |            |            |             |           |
|   |       | open edx labs        |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   17. | Change lab names     | [[https://github.com/vlead/vlabs-landing-pages/issues/100][#100]]       |       16 |     16 | 22-10-2017 | 22-10-2017 | Done        | Balamma   |
|   |       | styles and images    |            |          |        | 22-10-2017 | 22-10-2017 |             | Sanchita  |
|   |       | properties as per    |            |          |        |            |            |             |           |
|   |       | open edx labs        |            |          |        |            |            |             |           |
|   |       | layout on            |            |          |        |            |            |             |           |
|   |       | individual           |            |          |        |            |            |             |           |
|   |       | institutes and       |            |          |        |            |            |             |           |
|   |       | Disciplines          |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   18. | Change lab names     | [[https://github.com/vlead/vlabs-landing-pages/issues/101][#101]]       |       08 |     08 | 13-10-2017 | 13-10-2017 | Done        | Mrudhvika |
|   |       | styles and images    |            |          |        | 13-10-2017 | 13-10-2017 |             | Sanchita  |
|   |       | properties as per    |            |          |        |            |            |             |           |
|   |       | open edx labs        |            |          |        |            |            |             |           |
|   |       | layout on keyword    |            |          |        |            |            |             |           |
|   |       | search page          |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   19. | Banner image on      | [[https://github.com/vlead/vlabs-landing-pages/issues/103][#103]]       |       12 |     12 | 12-10-2017 | 12-10-2017 | Done        | Mrudhvika |
|   |       | vlabs landing pages  |            |          |        | 12-10-2017 | 12-10-2017 |             | Sanchita  |
|   |       |                      |            |          |        |            |            |             | Balamma   |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   20. | Fixing grid styles   | [[https://github.com/vlead/vlabs-landing-pages/issues/105][#105]]       |       16 |     16 | 23-10-2017 | 23-10-2017 | Done        | Balamma   |
|   |       | while traversing     |            |          |        | 24-10-2017 | 24-10-2017 |             | Mrudhvika |
|   |       | through individual   |            |          |        |            |            |             |           |
|   |       | institutes and       |            |          |        |            |            |             |           |
|   |       | disciplines          |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   21. | Recollecting 6 labs  | [[https://github.com/vlead/vlabs-landing-pages/issues/106][#106]]       |       08 |     08 | 17-10-2017 | 17-10-2017 | Done        | Mrudhvika |
|   |       | images to update     |            |          |        | 17-10-2017 | 17-10-2017 |             |           |
|   |       | on lds               |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   22. | Remove header        | [[https://github.com/vlead/vlabs-landing-pages/issues/108][#108]]  [[https://github.com/vlead/vlabs-landing-pages/issues/111][#111]] |       10 |     10 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|   |       | iframe and create    | [[https://github.com/vlead/vlabs-landing-pages/issues/110][#110]]  [[https://github.com/vlead/vlabs-landing-pages/issues/112][#112]] |          |        | 25-10-2017 | 25-10-2017 |             | Madhavi   |
|   |       | header division in   | [[https://github.com/vlead/vlabs-landing-pages/issues/113][#113]]  [[https://github.com/vlead/vlabs-landing-pages/issues/114][#114]] |          |        |            |            |             | Mrudhvika |
|   |       | html                 |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   23. | Unable to navigate   | [[https://github.com/vlead/vlabs-landing-pages/issues/109][#109]]       |       16 |      1 | 25-10-2017 | 25-10-2017 | Done        | Madhavi   |
|   |       | discipline wise      |            |          |        | 26-10-2017 | 26-10-2017 |             |           |
|   |       | labs from            |            |          |        |            |            |             |           |
|   |       | experiment page      |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   24. | Adding header        | [[https://github.com/vlead/vlabs-landing-pages/issues/110][#110]]       |       02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|   |       | division to vlabs    |            |          |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|   |       | landing pages.       |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   25. | Adding banner in a   | [[https://github.com/vlead/vlabs-landing-pages/issues/111][#111]]       |       02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|   |       | division to vlabs    |            |          |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|   |       | landing pages.       |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   26. | Adding usage         | [[https://github.com/vlead/vlabs-landing-pages/issues/112][#112]]       |       02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|   |       | section              |            |          |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   27. | Fixing the height    | [[https://github.com/vlead/vlabs-landing-pages/issues/113][#113]]       |       02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|   |       | of the content       |            |          |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|   |       | iframe.              |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   28. | Adding styles to     | [[https://github.com/vlead/vlabs-landing-pages/issues/114][#114]]       |       02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|   |       | the header division  |            |          |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   29. | After removing the.  | [[https://github.com/vlead/vlabs-landing-pages/issues/115][#115]]       |       32 |     26 | 25-10-2017 | 25-10-2017 | Done        | Madhavi   |
|   |       | header iframe, Key   |            |          |        | 26-10-2017 | 26-10-2017 |             |           |
|   |       | word search          |            |          |        |            |            |             |           |
|   |       | functionality is     |            |          |        |            |            |             |           |
|   |       | breaking             |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   30. | Bug:Loading labs     | [[https://github.com/vlead/vlabs-landing-pages/issues/116][#116]]       |       32 |        | 25-10-2016 |            | Bug         | Madhavi   |
|   |       | and institutes in    |            |          |        | 27-10-2016 |            | In Progress | Balamma   |
|   |       | a same page, while   |            |          |        |            |            |             | Mrudhvika |
|   |       | traveling through    |            |          |        |            |            |             |           |
|   |       | browser back         |            |          |        |            |            |             |           |
|   |       | button from the      |            |          |        |            |            |             |           |
|   |       | experiment page.     |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   31. | Bug:Loading labs     | [[https://github.com/vlead/vlabs-landing-pages/issues/117][#117]]       |       32 |        | 25-10-2016 |            | Bug         | Madhavi   |
|   |       | AND Disciplines in   |            |          |        | 27-10-2016 |            | In Progress | Balamma   |
|   |       | same page, while     |            |          |        |            |            |             | Mrudhvika |
|   |       | traveling through    |            |          |        |            |            |             |           |
|   |       | browser back         |            |          |        |            |            |             |           |
|   |       | button from the      |            |          |        |            |            |             |           |
|   |       | experiment page      |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   32. | Styles are breaking, | [[https://github.com/vlead/vlabs-landing-pages/issues/118][#118]]       |       32 |        | 25-10-2017 |            | Bug         | Madhavi   |
|   |       | while traveling      |            |          |        | 27-10-2017 |            | In Progress | Balamma   |
|   |       | through browser      |            |          |        |            |            |             | Mrudhvika |
|   |       | back button from     |            |          |        |            |            |             |           |
|   |       | the experiment       |            |          |        |            |            |             |           |
|   |       | page to institutes   |            |          |        |            |            |             |           |
|   |       | page.                |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   33. | Styles are breaking, | [[https://github.com/vlead/vlabs-landing-pages/issues/119][#119]]       |       32 |        | 25-10-2017 |            | Bug         | Madhavi   |
|   |       | while traveling      |            |          |        | 27-10-2017 |            | In Progress | Balamma   |
|   |       | through browser      |            |          |        |            |            |             | Mrudhvika |
|   |       | back button from     |            |          |        |            |            |             |           |
|   |       | the experiment       |            |          |        |            |            |             |           |
|   |       | page to disciplines  |            |          |        |            |            |             |           |
|   |       | page.                |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   34. | Reference            | [[https://github.com/vlead/vlabs-landing-pages/issues/120][#120]]       |       08 |     08 | 26-10-2017 | 26-10-2017 | Done        | Madhavi   |
|   |       | Error '$'            |            |          |        | 26-10-2017 | 26-10-2017 |             |           |
|   |       | not defined          |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   35. | Loading all          | [[https://github.com/vlead/vlabs-landing-pages/issues/122][#122]]       |       08 |     08 | 26-10-2017 | 26-10-2017 | Done        | Madhavi   |
|   |       | disciplines          |            |          |        | 26-10-2017 | 26-10-2017 |             |           |
|   |       | on home page         |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   |   36. | Fixing institutes    | [[https://github.com/vlead/vlabs-landing-pages/issues/123][#123]]       |       01 |    0.5 | 26-10-2017 | 26-10-2017 | Done        | Balamma   |
|   |       | and disciplines      |            |          |        | 26-10-2017 | 26-10-2017 |             | Mrudhvika |
|   |       | icons height         |            |          |        |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
|   | Total |                      |            |      472 |  217.5 |            |            |             |           |
| ^ |       |                      |            |      est |    act |            |            |             |           |
|---+-------+----------------------+------------+----------+--------+------------+------------+-------------+-----------|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)

** Loading data dynamically from LDS
   Logging time against each issue started midway during the
   realization of the milestone.
   
   Once this [[https://github.com/vlead/vlabs-landing-pages/milestone/4][milestone]] is realized, the following are done
   to the VLABS portal:
   1. All institutes can be populated dynamically.
   2. All Disciplines can be populated dynamically.
   3. All labs can be populated dynamically on clicking on
      each institute.
   4. All labs can be populated dynamically clicking on each
      discipline.
   5. All labs can be populated dynamically.
   6. Styles can be applied dynamically.
   7. Footer service can be integrated as a service.
 

#+caption:  realization-plan-milestone-4
#+name: tbl-rlz-pln-ml-4
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    S. | Tasks                | Github | Expected | Actual |     Actual |  Estimated | Status   | Assignee   |
|   |    NO |                      | Issues |   Effort | Effort |     Start, |     Start/ |          |            |
|   |       |                      |        |      (in |    (in |        End |        End |          |            |
|   |       |                      |        |   person | person |      Dates |      Dates |          |            |
|   |       |                      |        |   hours) | hours) |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    1. | Ability to           | [[https://github.com/vlead/vlabs-landing-pages/issues/2][#2]]     |       42 |     30 | 31-08-2017 | 31-08-2017 | Done     | Madhavi    |
|   |       | display the          |        |          |        | 07-09-2017 | 09-09-2017 |          | Mrudhvika  |
|   |       | labs                 |        |          |        |            |            |          |            |
|   |       | developed            |        |          |        |            |            |          |            |
|   |       | by Partner           |        |          |        |            |            |          |            |
|   |       | Institutes           |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    2. | Dynamic footer       | [[https://github.com/vlead/vlabs-landing-pages/issues/21][#21]]    |       24 |     32 | 29-08-2017 | 29-08-2017 | Done     | Sanchita   |
|   |       | service need to      |        |          |        | 05-09-2017 | 31-08-2017 |          |            |
|   |       | be integrated        |        |          |        |            |            |          |            |
|   |       | into an iframe       |        |          |        |            |            |          |            |
|   |       | of landing page      |        |          |        |            |            |          |            |
|   |       |                      |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    3. | Update the hosted    | [[https://github.com/vlead/vlabs-landing-pages/issues/25][#25]]    |        8 |      8 | 07-09-2017 | 07-09-2017 | Done     | Sanchita   |
|   |       | URLs of labs in LDS  |        |          |        | 08-09-2017 | 08-09-2017 |          |            |
|   |       | with openedx URLs    |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    4. | collect thumbnail    | [[https://github.com/vlead/vlabs-landing-pages/issues/24][#24]]    |       24 |     24 | 31-08-2017 | 31-08-2017 | Done     | Balamma    |
|   |       | for all the          |        |          |        | 03-09-2017 | 03-09-2017 |          |            |
|   |       | labs                 |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    5. | All labs are loading | [[https://github.com/vlead/vlabs-landing-pages/issues/71][#71]]    |          |        |            |            | backlog  | Madhvi     |
|   |       | 3 labs in a row      |        |          |        |            |            |          | Mrudhvika  |
|   |       | instead it should    |        |        8 |      8 | 31-08-2017 | 31-08-2017 | Done     | Sanchita   |
|   |       | load 4 labs          |        |          |        |            |            |          | Balamma    |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    6. | Labs hosted on       | [[https://github.com/vlead/vlabs-landing-pages/issues/30][#30]]    |        8 |    0.5 | 11-09-2017 | 11-09-2017 | Done     | Madhavi    |
|   |       | 'open-edx' are       |        |          |        | 11-09-2017 | 11-09-2017 |          |            |
|   |       | not loading          |        |          |        |            |            |          |            |
|   |       | in an iframe         |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    7. | current theming      | [[https://github.com/vlead/vlabs-landing-pages/issues/31][#31]]    |          |        |            |            | Done     | Shiva      |
|   |       | for open-edx         |        |          |        |            |            |          | Raghupathi |
|   |       | labs has to          |        |          |        |            |            |          |            |
|   |       | be removed           |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    8. | create test          | [[https://github.com/vlead/vlabs-landing-pages/issues/32][#32]]    |          |        |            |            | Done     | Shiva      |
|   |       | open-edx instance    |        |          |        |            |            |          | Raghupathi |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    9. | Deploy all the       | [[https://github.com/vlead/vlabs-landing-pages/issues/33][#33]]    |          |        |            |            |          | Shiva      |
|   |       | labs on test         |        |          |        |            |            | Done     | Raghupathi |
|   |       | open-edx instance    |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   10. | Remove theming       | [[https://github.com/vlead/vlabs-landing-pages/issues/34][#34]]    |        8 |        |            |            | Done     | Shiva      |
|   |       | from test            |        |          |        |            |            |          | Raghupathi |
|   |       | instance of          |        |          |        |            |            |          |            |
|   |       | open-edx             |        |          |        |            |            |          |            |
|   |       | 'hosting_info'       |        |          |        | 14-09-2017 | 14-09-2017 |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   11. | Add a new row to     | [[https://github.com/vlead/vlabs-landing-pages/issues/35][#35]]    |        8 |      8 | 14-09-2017 | 14-09-2017 | Done     | Mrudhvika  |
|   |       | of 'lab' table       |        |          |        | 14-09-2017 | 14-09-2017 |          |            |
|   |       | and update           |        |          |        |            |            |          |            |
|   |       | 'hosted_on' to       |        |          |        |            |            |          |            |
|   |       | 'test-openedx'       |        |          |        |            |            |          |            |
|   |       | and also             |        |          |        |            |            |          |            |
|   |       | update               |        |          |        |            |            |          |            |
|   |       | 'hosted_url'         |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   12. | Update config in     | [[https://github.com/vlead/vlabs-landing-pages/issues/36][#36]]    |       12 |      9 | 14-09-2017 | 14-09-2017 | Done     | Madhavi    |
|   |       | the vlabs landing    |        |          |        | 15-09-2017 | 15-09-2017 |          |            |
|   |       | pages to read        |        |          |        |            |            |          |            |
|   |       | either the           |        |          |        |            |            |          |            |
|   |       | hosted url of        |        |          |        |            |            |          |            |
|   |       | production or        |        |          |        |            |            |          |            |
|   |       | test instance of     |        |          |        |            |            |          |            |
|   |       | openedx              |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   13. | Some labs are        | [[https://github.com/vlead/vlabs-landing-pages/issues/37][#37]]    |       16 |        | 09-09-2017 | 09-09-2017 | In       | Sanchita   |
|   |       | not captured in      |        |          |        | 11-09-2017 |            | Progress |            |
|   |       | lds database         |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   14. | Styling for          |        |          |        |            |            | In       | Balamma    |
|   |       | vlabs-landing-pages  | [[https://github.com/vlead/vlabs-landing-pages/issues/29][#29]]    |          |        |            |            | progress |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   15. | Populate 'Asset      |        |       12 |      8 | 09-09-2017 | 09-09-2017 | Done     | Mrudhvika  |
|   |       | Urls' for all        | [[https://github.com/vlead/vlabs-landing-pages/issues/28][#28]]    |          |        | 09-09-2017 | 09-09-2017 |          |            |
|   |       | the Labs in LDS.     |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   16. | Ability to display   | [[https://github.com/vlead/vlabs-landing-pages/issues/3][#3]]     |       18 |     24 | 30-08-2017 | 30-08-2017 | Done     | Madhavi    |
|   |       | all Discipline and   |        |          |        | 05-09-2017 | 04-09-2017 |          |            |
|   |       | Domain wise labs     |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   17. | Header Styling for   | [[https://github.com/vlead/vlabs-landing-pages/issues/41][#41]]    |       40 |     40 | 04-09-2017 | 04-09-2017 | Done     | Balamma    |
|   |       | Vlabs landing page   |        |          |        | 08-09-2017 | 08-09-2017 |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   18. | Apply grid styles    | [[https://github.com/vlead/vlabs-landing-pages/issues/43][#43]]    |       40 |     36 | 11-09-2017 | 11-09-2017 | Done     | Balamma    |
|   |       | for Institutes       |        |          |        | 13-09-2017 | 15-09-2017 |          | Madhavi    |
|   |       | images               |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   19. | Apply grid styles    | [[https://github.com/vlead/vlabs-landing-pages/issues/44][#44]]    |       40 |     36 | 13-09-2017 | 13-09-2017 | Done     | Balamma    |
|   |       | for Disciplines      |        |          |        | 15-09-2017 | 15-09-2017 |          | Madhavi    |
|   |       | images               |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   20. | Apply grid styles    | [[https://github.com/vlead/vlabs-landing-pages/issues/45][#45]]    |       40 |     36 | 15-09-2017 | 13-09-2017 | Done     | Balamma    |
|   |       | for All Labs images  |        |          |        | 19-09-2017 | 15-09-2017 |          | Madhavi    |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   21. | Requirements for     | [[https://github.com/vlead/vlabs-landing-pages/issues/10][#10]]    |        6 |      2 | 30-09-2017 | 30-09-2017 | Done     | Thirumal   |
|   |       | Vlabs Landing Pages  |        |          |        | 30-09-2017 | 30-09-2017 |          | Madhavi    |
|   |       |                      |        |          |        |            |            |          | Balamma    |
|   |       |                      |        |          |        |            |            |          | Mrudhvika  |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   22. | Design for           | [[https://github.com/vlead/vlabs-landing-pages/issues/9][#9]]     |        2 |    0.5 | 13-09-2017 | 13-09-2017 | Done     | Mrudhvika  |
|   |       | Vlabs Landing Page   |        |          |        | 13-09-2017 | 13-09-2017 |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   23. | Setting up           | [[https://github.com/vlead/vlabs-landing-pages/issues/27][#27]]    |      0.5 |    0.5 | 08-09-2017 | 08-09-2017 | Done     | Madhavi    |
|   |       | Incremental build    |        |          |        | 08-09-2017 | 08-09-2017 |          | Mrudhvika  |
|   |       | in local machine     |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   24. | Set up               | [[https://github.com/vlead/vlabs-landing-pages/issues/18][#18]]    |        1 |      1 | 31-08-2017 | 31-08-2017 | Done     | Madhavi    |
|   |       | lab data service     |        |          |        | 31-08-2017 | 31-08-2017 |          | Mrudhvika  |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   25. | change 'institute'   | [[https://github.com/vlead/vlabs-landing-pages/issues/51][#51]]    |          |        |            |            |          |            |
|   |       | tab in the header    |        |          |        |            |            |          |            |
|   |       | to drop down menu    |        |          |        |            |            |          |            |
|   |       | to display all       |        |          |        |            |            |          |            |
|   |       | institutes           |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   26. | change 'discipline'  | [[https://github.com/vlead/vlabs-landing-pages/issues/52][#52]]    |          |        |            |            |          |            |
|   |       | tab in the header    |        |          |        |            |            |          |            |
|   |       | to drop down menu    |        |          |        |            |            |          |            |
|   |       | to display all       |        |          |        |            |            |          |            |
|   |       | disciplines          |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   27. | check the images     | [[https://github.com/vlead/vlabs-landing-pages/issues/54][#54]]    |          |        |            |            |          |            |
|   |       | for all the labs     |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   28. | Syntax error in      | [[https://github.com/vlead/vlabs-landing-pages/issues/55][#55]]    |          |        |            |            |          |            |
|   |       | footer               |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   29. | Reference Error:     | [[https://github.com/vlead/vlabs-landing-pages/issues/56][#56]]    |          |        |            |            |          |            |
|   |       | $ is not defined     |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |   30. | Collect Discipline   | [[https://github.com/vlead/vlabs-landing-pages/issues/22][#22]]    |          |        |            |            |          |            |
|   |       | and institute images |        |          |        |            |            |          |            |
|   |       | and update their     |        |          |        |            |            |          |            |
|   |       | links in lds         |        |          |        |            |            |          |            |
|   |       |                      |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    31 | Footer edges should  | [[https://github.com/vlead/vlabs-landing-pages/issues/73][#73]]    |          |        |            |            |          |            |
|   |       | be same as iframe    |        |          |        |            |            |          |            |
|   |       | edges                |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    32 | Deployment of        |        |          |        |            |            |          |            |
|   |       | vlabs-landing-pages  | [[https://github.com/vlead/vlabs-landing-pages/issues/76][#76]]    |          |        |            |            |          |            |
|   |       | on testing and       |        |          |        |            |            |          |            |
|   |       | staging              |        |          |        |            |            |          |            |
|   |       | environments         |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    33 | all fonts should     | [[https://github.com/vlead/vlabs-landing-pages/issues/72][#72]]    |          |        |            |            |          |            |
|   |       | be consistency       |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    34 | Maintain separate    | [[https://github.com/vlead/vlabs-landing-pages/issues/61][#61]]    |          |        |            |            |          |            |
|   |       | Javascript files     |        |          |        |            |            |          |            |
|   |       | for individual       |        |          |        |            |            |          |            |
|   |       | frames               |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    35 | Load 'Usage' and     | [[https://github.com/vlead/vlabs-landing-pages/issues/74][#74]]    |          |        |            |            |          |            |
|   |       | 'Workshop Usage'     |        |          |        |            |            |          |            |
|   |       | page in content      |        |          |        |            |            |          |            |
|   |       | Iframe               |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    36 | All labs are         | [[https://github.com/vlead/vlabs-landing-pages/issues/79][#79]]    |          |        |            |            |          |            |
|   |       | loading 3 labs       |        |          |        |            |            |          |            |
|   |       | in a row instead     |        |          |        |            |            |          |            |
|   |       | it should load       |        |          |        |            |            |          |            |
|   |       | 4 labs.              |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    37 | Collect other        | [[https://github.com/vlead/vlabs-landing-pages/issues/67][#67]]    |          |        |            |            |          |            |
|   |       | discipline           |        |          |        |            |            |          |            |
|   |       | icons/images         |        |          |        |            |            |          |            |
|   |       | and update them      |        |          |        |            |            |          |            |
|   |       | in the database      |        |          |        |            |            |          |            |
|   |       | and also in the      |        |          |        |            |            |          |            |
|   |       | file server          |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    38 | Header Iframe is     | [[https://github.com/vlead/vlabs-landing-pages/issues/14][#14]]    |          |        |            |            |          |            |
|   |       | overlapping with     |        |          |        |            |            |          |            |
|   |       | content Iframe       |        |          |        |            |            |          |            |
|   |       |                      |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    39 | Remove extra white   | [[https://github.com/vlead/vlabs-landing-pages/issues/69][#69]]    |          |        |            |            |          |            |
|   |       | space between items  |        |          |        |            |            |          |            |
|   |       | in 'Institute' and   |        |          |        |            |            |          |            |
|   |       | 'Discipline'         |        |          |        |            |            |          |            |
|   |       | drop down menu       |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    40 | Add banner/slider    | [[https://github.com/vlead/vlabs-landing-pages/issues/64][#64]]    |          |        |            |            |          |            |
|   |       | on the home page     |        |          |        |            |            |          |            |
|   |       | of dynamic vlabs     |        |          |        |            |            |          |            |
|   |       | portal               |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    41 | Add 'Analytics'      | [[https://github.com/vlead/vlabs-landing-pages/issues/68][#68]]    |          |        |            |            |          |            |
|   |       | band below the       |        |          |        |            |            |          |            |
|   |       | banner to show       |        |          |        |            |            |          |            |
|   |       | various usage        |        |          |        |            |            |          |            |
|   |       | counts               |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    42 | Onload display       | [[https://github.com/vlead/vlabs-landing-pages/issues/66][#66]]    |          |        |            |            |          |            |
|   |       | all Disciplines      |        |          |        |            |            |          |            |
|   |       | on home page         |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    43 | Apply 'Grid Style'   | [[https://github.com/vlead/vlabs-landing-pages/issues/62][#62]]    |          |        |            |            |          |            |
|   |       | to each institute    |        |          |        |            |            |          |            |
|   |       | labs selected from   |        |          |        |            |            |          |            |
|   |       | 'Institute Combo     |        |          |        |            |            |          |            |
|   |       | box'                 |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    44 | Apply 'Grid Style'   | [[https://github.com/vlead/vlabs-landing-pages/issues/63][#63]]    |          |        |            |            |          |            |
|   |       | to each discipline   |        |          |        |            |            |          |            |
|   |       | wise labs selected   |        |          |        |            |            |          |            |
|   |       | from 'Discipline     |        |          |        |            |            |          |            |
|   |       | Combo box'           |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    45 | Add 'Hyperlink'      | [[https://github.com/vlead/vlabs-landing-pages/issues/59][#59]]    |          |        |            |            |          |            |
|   |       | to lab image         |        |          |        |            |            |          |            |
|   |       | and lab name         |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    46 | Implementation       | [[https://github.com/vlead/vlabs-landing-pages/issues/5][#5]]     |          |        |            |            |          |            |
|   |       | of Header for        |        |          |        |            |            |          |            |
|   |       | vlabs landing        |        |          |        |            |            |          |            |
|   |       | page                 |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    47 | Ability to display   | [[https://github.com/vlead/vlabs-landing-pages/issues/1][#1]]     |          |        |            |            |          |            |
|   |       | All Labs             |        |          |        |            |            |          |            |
|   |       | dynamically          |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    48 | Apply hidden to      | [[https://github.com/vlead/vlabs-landing-pages/issues/58][#58]]    |          |        |            |            |          |            |
|   |       | 'Search', 'SignUp'   |        |          |        |            |            |          |            |
|   |       | and 'Login' buttons  |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    49 | Update the Asset     | [[https://github.com/vlead/vlabs-landing-pages/issues/53][#53]]    |          |        |            |            |          |            |
|   |       | urls images of       |        |          |        |            |            |          |            |
|   |       | non-openedx labs     |        |          |        |            |            |          |            |
|   |       | in lds database      |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    50 | Collect Images for   | [[https://github.com/vlead/vlabs-landing-pages/issues/47][#47]]    |          |        |            |            |          |            |
|   |       | non-openedx labs     |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    51 | Consistency size     | [[https://github.com/vlead/vlabs-landing-pages/issues/48][#48]]    |          |        |            |            |          |            |
|   |       | of All labs Images   |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    52 | Consistency size     | [[https://github.com/vlead/vlabs-landing-pages/issues/49][#49]]    |          |        |            |            |          |            |
|   |       | of All Institutes    |        |          |        |            |            |          |            |
|   |       | Images               |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    53 | Footer Service       | [[https://github.com/vlead/vlabs-landing-pages/issues/13][#13]]    |          |        |            |            |          |            |
|   |       | Integration          |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   |    54 | design of the        | [[https://github.com/vlead/vlabs-landing-pages/issues/20][#20]]    |          |        |            |            |          |            |
|   |       | VLABS portal         |        |          |        |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   | Total |                      |        |    357.5 |  303.5 |            |            |          |            |
| ^ |       |                      |        |      est |    act |            |            |          |            |
|---+-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)

** Fix Back Button Functionality
#+caption:  realization-plan-milestone-8
#+name: tbl-rlz-pln-ml-8
|---+-------+-----------------------+--------+----------+--------+------------+------------+---------+----------|
|   |    S. | Tasks                 | Github | Expected | Actual |     Actual |  Estimated | Status  | Assignee |
|   |    NO |                       | Issues | Effort   | Effort |     Start, |     Start/ |         |          |
|   |       |                       |        | (in      | (in    |        End |        End |         |          |
|   |       |                       |        | person   | person |      Dates |      Dates |         |          |
|   |       |                       |        | hours)   | hours) |            |            |         |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+---------+----------|
|   |    1. | Styles are breaking,  | [[https://github.com/vlead/vlabs-landing-pages/issues/118][#118]]   |          |        | 02-11-2017 | 13-10-2017 | Backlog |          |
|   |       | while traveling       |        |          |        | 02-11-2017 | 13-10-2017 |         |          |
|   |       | through browser back  |        |          |        |            |            |         |          |
|   |       | button from the       |        |          |        |            |            |         |          |
|   |       | experiment page to    |        |          |        |            |            |         |          |
|   |       | institutes page       |        |          |        |            |            |         |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+---------+----------|
|   |    2. | Styles are breaking,  | [[https://github.com/vlead/vlabs-landing-pages/issues/119][#119]]   |          |        | 02-11-2017 | 13-10-2017 |         |          |
|   |       | while traveling       |        |          |        | 02-11-2017 | 13-10-2017 |         |          |
|   |       | through browser back  |        |          |        |            |            | Backlog |          |
|   |       | button from the       |        |          |        |            |            |         |          |
|   |       | experiment page to    |        |          |        |            |            |         |          |
|   |       | disciplines page      |        |          |        |            |            |         |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+---------+----------|
|   |    3. | Bug:Loading labs and  | [[https://github.com/vlead/vlabs-landing-pages/issues/116][#116]]   |          |        | 02-11-2017 | 02-11-2017 |         |          |
|   |       | institutes in a same  |        |          |        | 02-11-2017 | 02-11-2017 |         |          |
|   |       | page, while traveling |        |          |        |            |            | Backlog |          |
|   |       | through browser back  |        |          |        |            |            |         |          |
|   |       | button from the       |        |          |        |            |            |         |          |
|   |       | experiment page       |        |          |        |            |            |         |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+---------+----------|
|   |    4. | Bug: Loading labs and | [[https://github.com/vlead/vlabs-landing-pages/issues/117][#117]]   |          |        | 13-10-2017 | 13-10-2017 |         |          |
|   |       | disciplines in a same |        |          |        | 13-10-2017 | 13-10-2017 | Backlog |          |
|   |       | page, while traveling |        |          |        |            |            |         |          |
|   |       | through browser back  |        |          |        |            |            |         |          |
|   |       | button from the       |        |          |        |            |            |         |          |
|   |       | experiment page       |        |          |        |            |            |         |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+---------+----------|
|   |    5. | Creating a "No labs   | [[https://github.com/vlead/vlabs-landing-pages/issues/135][#135]]   |          |        | 13-10-2017 | 13-10-2017 | Backlog |          |
|   |       | found" page           |        |          |        | 13-10-2017 | 13-10-2017 |         |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+---------+----------|
|   |    6. | Displaying email id   | [[https://github.com/vlead/vlabs-landing-pages/issues/142][#142]]   |          |        | 13-10-2017 | 13-10-2017 |         |          |
|   |       | in the place of       |        |          |        | 13-10-2017 | 13-10-2017 |         |          |
|   |       | register when user    |        |          |        |            |            | Backlog |          |
|   |       | logged in to          |        |          |        |            |            |         |          |
|   |       | vlabs landing pages   |        |          |        |            |            |         |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+---------+----------|
|   |    7. | deploy application    | [[https://github.com/vlead/vlabs-landing-pages/issues/148][#148]]   |          |        | 13-10-2017 | 13-10-2017 |         |          |
|   |       | on nginx server       |        |          |        | 13-10-2017 | 13-10-2017 | Backlog |          |
|   |       | using ADS             |        |          |        |            |            |         |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+---------+----------|
|   | Total |                       |        | 0        | 0      |            |            |         |          |
| ^ |       |                       |        | est      | act    |            |            |         |          |
|---+-------+-----------------------+--------+----------+--------+------------+------------+---------+----------|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)

** upgrade openedx version from dogwood to ginkgo
#+caption:  realization-plan-milestone-9
#+name: tbl-rlz-pln-ml-9
|---+-------+------------------------+--------+----------+--------+------------+------------+-------------+----------|
|   |    S. | Tasks                  | Github | Expected | Actual |     Actual |  Estimated | Status      | Assignee |
|   |    NO |                        | Issues | Effort   | Effort |     Start, |     Start/ |             |          |
|   |       |                        |        | (in      | (in    |        End |        End |             |          |
|   |       |                        |        | person   | person |      Dates |      Dates |             |          |
|   |       |                        |        | hours)   | hours) |            |            |             |          |
|---+-------+------------------------+--------+----------+--------+------------+------------+-------------+----------|
|   |    1. | openedx user database  | [[https://github.com/vlead/vlabs-landing-pages/issues/150][#150]]   | 6        |        | 12-12-2017 | 13-12-2017 | In progress |          |
|   |       | migration from dogwood |        |          |        | 13-12-2017 |            |             |          |
|   |       | to ginkgo version      |        |          |        |            |            |             |          |
|   |       |                        |        |          |        |            |            |             |          |
|   |       |                        |        |          |        |            |            |             |          |
|   |       |                        |        |          |        |            |            |             |          |
|---+-------+------------------------+--------+----------+--------+------------+------------+-------------+----------|
|   |    2. | setup vm running       | [[https://github.com/vlead/vlabs-landing-pages/issues/151][#151]]   | 6        |        | 08-12-2017 | 12-10-2017 |             |          |
|   |       | openedx ginkgo version |        |          |        | 08-12-2017 | 12-10-2017 |             |          |
|   |       |                        |        |          |        |            |            | Done        |          |
|   |       |                        |        |          |        |            |            |             |          |
|   |       |                        |        |          |        |            |            |             |          |
|   |       |                        |        |          |        |            |            |             |          |
|---+-------+------------------------+--------+----------+--------+------------+------------+-------------+----------|
|   |    3. | steps to be documented | [[https://github.com/vlead/vlabs-landing-pages/issues/152][#152]]   | 6        |        | 13-11-2017 | 14-11-2017 | Backlog     |          |
|   |       | post installation      |        |          |        | 14-11-2017 |            |             |          |
|   |       | of opedx platform      |        |          |        |            |            |             |          |
|   |       | running ginkgo version |        |          |        |            |            |             |          |
|   |       |                        |        |          |        |            |            |             |          |
|   |       |                        |        |          |        |            |            |             |          |
|---+-------+------------------------+--------+----------+--------+------------+------------+-------------+----------|
|   | Total |                        |        | 18       | 0      |            |            |             |          |
| ^ |       |                        |        | est      | act    |            |            |             |          |
|---+-------+------------------------+--------+----------+--------+------------+------------+-------------+----------|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)
